Revit 2024 API
AXMImportOptions Class
 The import options used to import AXM format files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public class AXMImportOptions : BaseImportOptions
Visual Basic
Public Class AXMImportOptions _
	Inherits BaseImportOptions
Visual C++
public ref class AXMImportOptions : public BaseImportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseImportOptions
 Autodesk.Revit.DB.AXMImportOptions
See Also
AXMImportOptions Members
Autodesk.Revit.DB Namespace